(function(){
    /*
     *	全国三级城市联动 js版
     */
    function Dsy(){
        this.Items = {};
    };
    Dsy.prototype.add = function(id,iArray){
        this.Items[id] = iArray;
    };
    Dsy.prototype.get = function(key) {
        return this.Items[key]
    };
    Dsy.prototype.Exists = function(id){
        if(typeof(this.Items[id]) == "undefined") return false;
        return true;
    };
    Dsy.prototype.init = function(select_box, address_arr, delete_city_arr, bindEvent) {
        var all_city = [];

        for(var i = 0; i < dsy.get(0).length; i++) {
            all_city[i] = dsy.get(0)[i];
        };

        if(delete_city_arr && delete_city_arr.length) {
            for(var i = 0; i < delete_city_arr.length; i++) {
                for(var j = 0; j < all_city.length; j++) {
                    if(all_city[j] == delete_city_arr[i]) {
                        all_city.splice(j, 1);
                    };
                };
            };
        };

        var select = $('select', select_box);
        var detail_input = $('.detail_address', select_box);
        var province = all_city;
        var city_index;
        var first_option = select.eq(0).get(0).options[0];

        select.eq(0).empty();
        select.eq(0).append(first_option);
        for(var i = 0; i < province.length; i++) {
            select.eq(0).append('<option>'+province[i]+'</option>')
        };
        select[0].selectedIndex = 0;
        select[1].selectedIndex = 0;
        // alert(address_arr);
        if(address_arr.length) {
            var old_province = address_arr[0];
            var old_city = address_arr[1];
            var old_home = address_arr[2];
            //three level of choose
            // var old_detail = address_arr[3];

            //start two level of choose
            if (address_arr[3]) {
                var old_detail = address_arr[2] + address_arr[3];
            }
            else {
                var old_detail = address_arr[2];
            }
            //end two level of choose
            var old_province_index = province.indexOf(old_province);

            select[0].selectedIndex = old_province_index + 1;

            var city_arr = dsy.get('0_' + old_province_index);
            var old_city_index = city_arr.indexOf(old_city);
            select.eq(1).children().remove();
            select.eq(1).append('<option>'+'请选择市'+'</option>');
            for(var i = 0; i < city_arr.length; i++) {
                select.eq(1).append('<option>'+city_arr[i]+'</option>');
            };
            select[1].selectedIndex = old_city_index + 1;
            city_index = old_province_index;

            var home_arr = dsy.get('0_' + old_province_index + '_' + old_city_index);
            var old_home_index = home_arr.indexOf(old_home);

            for(var i = 0; i < home_arr.length; i++) {
                select.eq(2).append('<option>'+home_arr[i]+'</option>');
            };
            select[2].selectedIndex = old_home_index + 1;

            detail_input.val(old_detail);
        };

        if(!bindEvent) {
            return;
        }

        select.eq(0).bind('change', function() {
            var select_index = this.selectedIndex;

            select_index--;
            var first_option = select.eq(1).get(0).options[0];
            var first_option2 = select.eq(2).get(0).options[0];

            select.eq(1).empty();
            select.eq(2).empty();
            select.eq(1).append(first_option);
            select.eq(2).append(first_option2);

            if(select_index >= 0) {
                select_index += '';
                city_index = select_index;
                console.log('0_' + select_index);
                var city = dsy.get('0_' + select_index);

                for(var i = 0; i < city.length; i++) {
                    select.eq(1).append('<option>'+city[i]+'</option>');
                };
            };
        });

        select.eq(1).bind('change', function() {
            var select_index = this.selectedIndex;

            select_index--;
            var first_option2 = select.eq(2).get(0).options[0];
            select.eq(2).empty();
            select.eq(2).append(first_option2);
            if(select_index >= 0) {
                select_index += '';
                console.log('0_' + city_index + '_' + select_index);
                var city = dsy.get('0_' + city_index + '_' + select_index);

                for(var i = 0; i < city.length; i++) {
                    select.eq(2).append('<option>'+city[i]+'</option>');
                };
            };
        });
    };
    window.dsy = new Dsy();

    dsy.add("0",[
      "北京市", //0
      "天津市",//1
      "上海市",//2
      "重庆市",//3
      "河北省",//4
      "山西省",//5
      "内蒙古",//6
      "辽宁省",//7
      "吉林省",//8
      "黑龙江省",//9
      "江苏省",//10
      "浙江省",//11
      "安徽省",//12
      "福建省",//13
      "江西省",//14
      "山东省",//15
      "河南省",//16
      "湖北省",//17
      "湖南省",//18
      "广东省",//19
      "广西",//20
      "海南省",//21
      "四川省",//22
      // "贵州省",//23
      "云南省",//24
      // "西藏",//25
      "陕西省",//26
      "甘肃省",//27
      // "青海省",//28
      "宁夏",//29
      // "新疆",//30
    ]);
    dsy.add("0_0_0",["东城区","西城区","崇文区","宣武区","朝阳区","丰台区","石景山区","海淀区","门头沟区","房山区","通州区","顺义区","昌平区","大兴区","怀柔区","平谷区","密云县","延庆县"]);
    dsy.add("0_0",["北京市"]);
    dsy.add("0_1_0",["和平区","河东区","河西区","南开区","河北区","红桥区","塘沽区","汉沽区","大港区","东丽区","西青区","津南区","北辰区","武清区","宝坻区","蓟县","宁河县","静海县"]);
    dsy.add("0_1",["天津市"]);
    dsy.add("0_2_0",["黄浦区","徐汇区","长宁区","静安区","普陀区","闸北区","虹口区","杨浦区","闵行区","宝山区","嘉定区","浦东新区","金山区","松江区","青浦区","奉贤区","崇明县"]);
    dsy.add("0_2",["上海市"]);
    dsy.add("0_3_0",["渝中区","大渡口区","江北区","沙坪坝区","九龙坡区","南岸区","北碚区","万盛区","双桥区","渝北区","巴南区","万州区","涪陵区","黔江区","长寿区","合川市","永川区市","江津市","南川市","綦江县","潼南县","铜梁县","大足县","荣昌县","璧山县","垫江县","武隆县","丰都县","城口县","梁平县","开县","巫溪县","巫山县","奉节县","云阳县","忠县","石柱县","彭水县","酉阳县","秀山县"]);
    dsy.add("0_3",["重庆市"]);
    dsy.add("0_4_0",["长安区","桥东区","桥西区","新华区","裕华区","井陉矿区","辛集市","藁城市","晋州市","新乐市","鹿泉市","井陉县","正定县","栾城县","行唐县","灵寿县","高邑县","深泽县","赞皇县","无极县","平山县","元氏县","赵县"]);
    dsy.add("0_4_1",["桥西区","桥东区","宣x化区","下花园区","宣化县","张北县","康保县","沽源县","尚义县","蔚县","阳原县","怀安县","万全县","怀来县","涿鹿县","赤城县","崇礼县"]);
    dsy.add("0_4_2",["双桥区","双滦区","鹰手营子矿区","承德县","兴隆县","平泉县","滦平县","隆化县","丰宁县","宽城县","围场县"]);
    dsy.add("0_4_3",["海港区","山海关区","北戴河区","昌黎县","抚宁县","卢龙县","青龙县"]);
    dsy.add("0_4_4",["路北区","路南区","古冶区","开平区","丰润区","丰南区","遵化市","迁安市","滦县","滦南县","乐亭县","迁西县","玉田县","曹妃甸"]);
    dsy.add("0_4_5",["安次区","广阳区","霸州市","三河市","固安县","开发区","永清县","香河县","大城县","文安县","大厂县"]);
    dsy.add("0_4_6",["新市区","北市区","南市区","定州市","涿州市","安国市","高碑店市","满城县","清苑县","易县","徐水县","涞源县","定兴县","顺平县","唐县","望都县","涞水县","高阳县","安新县","雄县","容城县","曲阳县","阜平县","博野县","蠡县",]);
    dsy.add("0_4_7",["桃城区","冀州市","深州市","枣强县","武邑县","武强县","饶阳县","安平县","故城县","景县","阜城县"]);
    dsy.add("0_4_8",["运河区","新华区","泊头市","任丘市","黄骅市","河间市","沧县","青县","东光县","海兴县","盐山县","肃宁县","南皮县","吴桥县","献县","孟村县"]);
    dsy.add("0_4_9",["桥东区","桥西区","南宫市","沙河市","邢台县","临城县","内丘县","柏乡县",,"隆尧县","任县","南和县","宁晋县","巨鹿县","新河县","广宗县","平乡县","威县","清河县","临西县"]);
    dsy.add("0_4_10",["丛台区","邯山区","复兴区","峰峰矿区","武安市","邯郸县","临漳县","成安县","大名县","涉县","磁县","肥乡县","永年县","邱县","鸡泽县","广平县","馆陶县","魏县","曲周县"]);
    dsy.add("0_4",["石家庄市","张家口市","承德市","秦皇岛市","唐山市","廊坊市","保定市","衡水市","沧州市","邢台市","邯郸市"]);
    dsy.add("0_5_0",["杏花岭区","小店区","迎泽区","尖草坪区","万柏林区","晋源区","古交市","清徐县","阳曲县","娄烦县"]);
    dsy.add("0_5_1",["朔城区","平鲁区","山阴县","应县","右玉县","怀仁县"]);
    dsy.add("0_5_2",["城区","矿区","南郊区","新荣区","阳高县","天镇县","广灵县","灵丘县","浑源县","左云县","大同县"]);
    dsy.add("0_5_3",["城区","矿区","郊区","平定县","盂县"]);
    dsy.add("0_5_4",["城区","郊区","潞城市","长治县","襄垣县","屯留县","平顺县","黎城县","壶关县","长子县","武乡县","沁县","沁源县"]);
    dsy.add("0_5_5",["城区","高平市","泽州县","沁水县","阳城县","陵川县"]);
    dsy.add("0_5_6",["忻府区","原平市","定襄县","五台县","代县","繁峙县","宁武县","静乐县","神池县","五寨县","岢岚县","河曲县","保德县","偏关县"]);
    dsy.add("0_5_7",["榆次区","介休市","榆社县","左权县","和顺县","昔阳县","寿阳县","太谷县","祁县","平遥县","灵石县"]);
    dsy.add("0_5_8",["尧都区","侯马市","霍州市","曲沃县","翼城县","襄汾县","洪洞县","古县","安泽县","浮山县","吉县","乡宁县","蒲县","大宁县","永和县","隰县","汾西县"]);
    dsy.add("0_5_9",["离石区","孝义市","汾阳市","文水县","中阳县","兴县","临县","方山县","柳林县","岚县","交口县","交城县","石楼县",]);
    dsy.add("0_5_10",["盐湖区","永济市","河津市","芮城县","临猗县","万荣县","新绛县","稷山县","闻喜县","夏县","绛县","平陆县","垣曲县"]);
    dsy.add("0_5",["太原市","朔州市","大同市","阳泉市","长治市","晋城市","忻州市","晋中市","临汾市","吕梁市","运城市"]);
    dsy.add("0_6_0",["回民区","新城区","玉泉区","赛罕区","托克托县","武川县","和林格尔县","清水河县","土默特左旗"]);
    dsy.add("0_6_1",["昆都仑区","东河区","青山区","石拐区","白云矿区","九原区","固阳县","土默特右旗","达尔罕茂明安联合旗"]);
    dsy.add("0_6_2",["海勃湾区","海南区","乌达区"]);
    dsy.add("0_6_3",["红山区","元宝山区","松山区","宁城县","林西县","阿鲁科尔沁旗","巴林左旗","巴林右旗","克什克腾旗","翁牛特旗","喀喇沁旗","敖汉旗"]);
    dsy.add("0_6_4",["科尔沁区","霍林郭勒市","开鲁县","库伦旗","奈曼旗","扎鲁特旗","科尔沁左翼中旗","科尔沁左翼后旗"]);
    dsy.add("0_6_5",["海拉尔区","满洲里市","扎赉诺尔区","扎兰屯市","牙克石市","根河市","额尔古纳市","阿荣旗","新巴尔虎右旗","新巴尔虎左旗","陈巴尔虎旗","鄂伦春自治旗" ,"鄂温克族旗","莫力达瓦旗"]);
    dsy.add("0_6_6",["东胜区","达拉特旗","准格尔旗","鄂托克前旗","鄂托克旗","杭锦旗","乌审旗","伊金霍洛旗","康巴什新区"]);
    dsy.add("0_6_7",["集宁区","丰镇市","卓资县","化德县","商都县","商都镇","兴和县","凉城县","察哈尔右翼前旗","察哈尔右翼中旗","察哈尔右翼后旗","四子王旗"]);
    dsy.add("0_6_8",["临河区","五原县","磴口县","乌拉特前旗","乌拉特中旗","乌拉特后旗","杭锦后旗"]);
    dsy.add("0_6_9",["乌兰浩特市","阿尔山市","突泉县","科尔沁右翼前旗","科尔沁右翼中旗","扎赉特旗"]);
    dsy.add("0_6_10",["锡林浩特市","二连浩特市","多伦县","阿巴嘎旗","苏尼特左旗","苏尼特右旗","东乌珠穆沁旗","西乌珠穆沁旗","太仆寺旗","镶黄旗","正镶白旗","正蓝旗"]);
    dsy.add("0_6_11",["额济纳旗","阿拉善右旗","额济纳旗",]);
    dsy.add("0_6",["呼和浩特市","包头市","乌海市","赤峰市","通辽市","呼伦贝尔市","鄂尔多斯市","乌兰察布市","巴彦淖尔市","兴安盟","锡林郭勒盟","阿拉善盟"]);
    dsy.add("0_7_0",["沈河区","和平区","大东区","皇姑区","铁西区","苏家屯区","东陵区","新城子区","于洪区","新民市","辽中县","康平县","法库县","沈北区" ,"浑南新区"]);
    dsy.add("0_7_1",["双塔区","龙城区","北票市","凌源市","朝阳县","建平县","喀喇沁左翼县"]);
    dsy.add("0_7_2",["海州区","新邱区","太平区","清河门区","细河区","彰武县","彰武镇","阜新县"]);
    dsy.add("0_7_3", ["银州区","清河区","调兵山市","开原市","铁岭县","西丰县","昌图县"]);
    dsy.add("0_7_4", ["顺城区","新抚区","东洲区","望花区","抚顺县","新宾县","清原县"]);
    dsy.add("0_7_5", ["平山区","溪湖区","明山区","南芬区","本溪县","桓仁县"]);
    dsy.add("0_7_6", ["白塔区","文圣区","宏伟区","弓长岭区","太子河区","灯塔市","辽阳县"]);
    dsy.add("0_7_7",["铁东区","铁西区","立山区","千山区","海城市","台安县","台安镇","岫岩县"]);
    dsy.add("0_7_8",["振兴区","元宝区","振安区","凤城市","东港市","宽甸县"]);
    dsy.add("0_7_9", ["西岗区","中山区","沙河口区","甘井子区","旅顺口区","金州区","瓦房店市","普兰店市","庄河市","长海县","高新园区","经济开发区"]);
    dsy.add("0_7_10", ["站前区","西市区","鲅鱼圈区","老边区","大石桥市","盖州市"]);
    dsy.add("0_7_11",["兴隆台区","双台子区","大洼县","盘山县"]);
    dsy.add("0_7_12", ["太和区","古塔区","凌河区","凌海市","北镇市","黑山县","义县","经济技术开发区"]);
    dsy.add("0_7_13",["龙港区","连山区","南票区","兴城市","绥中县","建昌县"]);
    dsy.add("0_7",["沈阳市","朝阳市","阜新市","铁岭市","抚顺市","本溪市","辽阳市","鞍山市","丹东市","大连市","营口市","盘锦市","锦州市","葫芦岛市"]);
    dsy.add("0_8_0",  ["朝阳区","南关区","宽城区","二道区","绿园区","双阳区","德惠市","九台市","榆树市","净月区","农安县","汽车产业开发区","高新技术开发区","经济技术开发区"]);
    dsy.add("0_8_1", ["洮北区","大安市","洮南市","镇赉县","通榆县"]);
    dsy.add("0_8_2", ["宁江区","扶余县","长岭县","乾安县","前郭县"]);
    dsy.add("0_8_3", ["船营区","龙潭区","昌邑区","丰满区","磐石市","蛟河市","桦甸市","舒兰市","永吉县"]);
    dsy.add("0_8_4", ["铁西区","铁东区","双辽市","公主岭市","梨树县","伊通县"]);
    dsy.add("0_8_5",["龙山区","西安区","东丰县","东辽县"]);
    dsy.add("0_8_6", ["东昌区","二道江区","梅河口市","集安市","通化县","辉南县","柳河县"]);
    dsy.add("0_8_7",["临江市","江源区","浑江区","抚松县","靖宇县","长白县"]);
    dsy.add("0_8_8", ["延吉市","图们市","敦化市","珲春市","龙井市","和龙市","汪清县","安图县"]);
    dsy.add("0_8",["长春市","白城市","松原市","吉林市","四平市","辽源市","通化市","白山市","延边州"]);
    dsy.add("0_9_0", ["松北区","道里区","南岗区","道外区","香坊区","平房区","呼兰区","双城市","尚志市","五常市","阿城区","依兰县","方正县","宾县","巴彦县","木兰县","通河县","延寿县"]);
    dsy.add("0_9_1", ["建华区","龙沙区","铁锋区","昂昂溪区","富拉尔基区","碾子山区","梅里斯区","讷河市","龙江县","依安县","泰来县","甘南县","富裕县","克山县","克东县","拜泉县"]);
    dsy.add("0_9_2",["桃山区","新兴区","茄子河区","勃利县"]);
    dsy.add("0_9_3",["爱辉区","北安市","五大连池市","嫩江县","逊克县","孙吴县"]);
    dsy.add("0_9_4", ["萨尔图区","龙凤区","让胡路区","大同区","红岗区","肇州县","肇源县","林甸县","杜尔伯特县"]);
    dsy.add("0_9_5", ["兴山区","向阳区","工农区","南山区","兴安区","东山区","凤翔镇","绥滨县","萝北县"]);
    dsy.add("0_9_6", ["伊春区","南岔区","友好区","西林区","翠峦区","新青区","美溪区","金山屯区","五营区","乌马河区","汤旺河区","带岭区","乌伊岭区","红星区","上甘岭区","铁力市","嘉荫县"]);
    dsy.add("0_9_7", ["前进区","向阳区","东风区","郊区","同江市","富锦市","桦南县","桦川县","汤原县","抚远县"]);
    dsy.add("0_9_8",["尖山区","岭东区","四方台区","宝山区","集贤县","友谊县","宝清县","饶河县",]);
    dsy.add("0_9_9",["鸡冠区","恒山区","滴道区","梨树区","城子河区","麻山区","虎林市","密山市","鸡东县",]);
    dsy.add("0_9_10",["爱民区","东安区","阳明区","西安区","穆棱市","绥芬河市","海林市","宁安市","东宁县","林口县"]);
    dsy.add("0_9_11",["北林区","安达市","肇东市","海伦市","望奎县","兰西县","青冈县","庆安县","明水县","绥棱县"]);
    dsy.add("0_9_12",["呼玛县" ,"塔河县","漠河县","加格达奇区","松岭区","呼中区","新林区"]);
    dsy.add("0_9",["哈尔滨市","齐齐哈尔市","七台河市","黑河市","大庆市","鹤岗市","伊春市","佳木斯市","双鸭山市","鸡西市","牡丹江市","绥化市","大兴安岭地区"]);
    dsy.add("0_10_0",["玄武区","秦淮区","建邺区","鼓楼区","浦口区","六合区","栖霞区","雨花台区","江宁区","溧水县","高淳区"]);
    dsy.add("0_10_1", ["云龙区","鼓楼区","贾汪区","泉山区","邳州市","新沂市","铜山区","睢宁县","沛县","丰县","金山桥开发区","铜山紧急技术开发区","八段工业园区"]);
    dsy.add("0_10_2", ["新浦区","连云区","海州区","赣榆县","灌云县","东海县","灌南县"]);
    dsy.add("0_10_3",["宿城区","宿豫区","沭阳县","泗阳县","泗洪县","宿迁经济开发区"]);
    dsy.add("0_10_4", ["清河区","清浦区","楚州区","淮阴区","金湖县","盱眙县","洪泽县","涟水县","经济开发区"]);
    dsy.add("0_10_5", ["亭湖区","盐都区","东台市","大丰市","射阳县","阜宁县","滨海县","响水县","建湖县"]);
    dsy.add("0_10_6", ["广陵区","邗江区","仪征市","江都区","高邮市","宝应县"]);
    dsy.add("0_10_7",["海陵区","高港区","靖江市","泰兴市","姜堰市","兴化市"]);
    dsy.add("0_10_8", ["崇川区","港闸区","海门市","启东市","通州区","如皋市","如东县","海安县","南通经济技术开发区"]);
    dsy.add("0_10_9", ["京口区","润州区","丹徒区","扬中市","丹阳市","句容市","镇江新区","丹徒新区"]);
    dsy.add("0_10_10", ["钟楼区","天宁区","戚墅堰区","新北区","武进区","金坛市","溧阳市"]);
    dsy.add("0_10_11",  ["崇安区","南长区","北塘区","滨湖区","惠山区","锡山区","江阴市","宜兴市","新区"]);
    dsy.add("0_10_12",["金阊区(姑苏区)","沧浪区(姑苏区)","平江区(姑苏区)","虎丘区","工业园区","相城区","吴江区","高新区","太仓市","常熟市","张家港市","吴中区","昆山市"]);
    dsy.add("0_10",["南京市","徐州市","连云港市","宿迁市","淮安市","盐城市","扬州市","泰州市","南通市","镇江市","常州市","无锡市","苏州市"]);
    dsy.add("0_11_0",  ["拱墅区","上城区","下城区","江干区","西湖区","滨江区","余杭区","萧山区","临安市","富阳市","建德市","桐庐县","淳安县","下沙区"]);
    dsy.add("0_11_1", ["吴兴区","南浔区","长兴县","德清县","安吉县"]);
    dsy.add("0_11_2", ["南湖区","秀洲区","平湖市","海宁市","桐乡市","嘉善县","海盐县"]);
    dsy.add("0_11_3",["定海区","普陀区","岱山县","嵊泗县"]);
    dsy.add("0_11_4", ["海曙区","江东区","江北区","北仑区","镇海区","鄞州区","慈溪市","余姚市","奉化市","宁海县","象山县","高新科技开发区"]);
    dsy.add("0_11_5", ["越城区","诸暨市","上虞区","嵊州市","柯桥区","新昌县"]);
    dsy.add("0_11_6", ["柯城区","衢江区","江山市","常山县","开化县","龙游县"]);
    dsy.add("0_11_7", ["婺城区","金东区","兰溪市","永康市","义乌市","东阳市","武义县","浦江县","磐安县"]);
    dsy.add("0_11_8", ["椒江区","黄岩区","路桥区","温岭市","三门县","天台县","玉环县","仙居县","临海市"]);
    dsy.add("0_11_9",["鹿城区","龙湾区","瓯海区","瑞安市","乐清市","茶山高教园区市","永嘉县","文成县","平阳县","泰顺县","洞头县","苍南县"]);
    dsy.add("0_11_10",["莲都区","龙泉市","缙云县","青田县","云和县","遂昌县","松阳县","庆元县" ,"景宁县"]);
    dsy.add("0_11",["杭州市","湖州市","嘉兴市","舟山市","宁波市","绍兴市","衢州市","金华市","台州市","温州市","丽水市"]);
    dsy.add("0_12_0", ["庐阳区","瑶海区","蜀山区","包河区", "滨湖新区","经济技术开发区","高新技术开发区","新站综合开发实验区","长丰县","政务文化新区","肥东县","庐江县","肥西县","巢湖市","北城新区"]);
    dsy.add("0_12_1",["埇桥区","砀山县","萧县","灵璧县","泗县","经济开发区"]);
    dsy.add("0_12_2",["相山区","杜集区","烈山区","濉溪县"]);
    dsy.add("0_12_3",["谯城区","涡阳县","蒙城县","利辛县"]);
    dsy.add("0_12_4", ["颍州区","颍东区","颍泉区","界首市","临泉县","太和县","阜南县","颍上县","经济开发区",]);
    dsy.add("0_12_5",["蚌山区","龙子湖区","禹会区","淮上区","怀远县","五河县","固镇县"]);
    dsy.add("0_12_6",["田家庵区","大通区","谢家集区","八公山区","潘集区","凤台县","淮南高新技术开发区"]);
    dsy.add("0_12_7",["琅琊区","南谯区","明光市","天长市","来安县","全椒县","定远县","凤阳县"]);
    dsy.add("0_12_8",["博望区","雨山区","花山区","当涂县","含山县","和县"]);
    dsy.add("0_12_9",["镜湖区","弋江区","三山区","鸠江区","芜湖县","繁昌县","南陵县"]);
    dsy.add("0_12_10",["铜官山区","狮子山区","郊区","铜陵县"]);
    dsy.add("0_12_11",["迎江区","大观区","宜秀区","桐城市","怀宁县","枞阳县","潜山县","太湖县","宿松县","望江县","岳西县","开发县"]);
    dsy.add("0_12_12",["屯溪区","黄山区","徽州区","歙县","休宁县","黟县","祁门县"]);
    dsy.add("0_12_13",["金安区","裕安区","寿县","霍邱县","舒城县","金寨县","霍山县"]);
    dsy.add("0_12_14",["贵池区","东至县" ,"石台县","青阳县"]);
    dsy.add("0_12_15",["宣州区","宁国市","郎溪县","广德县","泾县","旌德县","绩溪县"]);
    dsy.add("0_12",["合肥市","宿州市","淮北市","亳州市","阜阳市","蚌埠市","淮南市","滁州市","马鞍山市","芜湖市","铜陵市","安庆市","黄山市","六安市","池州市","宣城市"]);
    dsy.add("0_13_0",  ["鼓楼区","台江区","仓山区","马尾区","晋安区","福清市","长乐市","闽侯县","连江县","罗源县","闽清县","永泰县","平潭县"]);
    dsy.add("0_13_1",["延平区","邵武市","武夷山市","建瓯市","建阳市","顺昌县","浦城县","光泽县","松溪县","政和县"]);
    dsy.add("0_13_2",["城厢区","涵江区","荔城区","秀屿区","仙游县"]);
    dsy.add("0_13_3",["梅列区","三元区","永安市","明溪县","清流县","宁化县","大田县","尤溪县","沙县","将乐县","泰宁县","建宁县"]);
    dsy.add("0_13_4", ["鲤城区","丰泽区","洛江区","泉港区","石狮市","晋江市","南安市","惠安县", ,"安溪县","永春县","德化县","金门县"]);
    dsy.add("0_13_5",["思明区","海沧区","湖里区","集美区","同安区","翔安区"]);
    dsy.add("0_13_6",["芗城区","龙文区","龙海市","云霄县","漳浦县","诏安县","长泰县","东山县","南靖县","平和县","华安县"]);
    dsy.add("0_13_7",["新罗区","漳平市","长汀县","永定县","上杭县","武平县","连城县"]);
    dsy.add("0_13_8",["蕉城区","福安市","福鼎市","寿宁县","霞浦县","柘荣县","屏南县","古田县","周宁县","东侨开发区"]);
    dsy.add("0_13",["福州市","南平市","莆田市","三明市","泉州市","厦门市","漳州市","龙岩市","宁德市"]);
    dsy.add("0_14_0", ["东湖区","西湖区","青云谱区","昌北区","湾里区","青山湖区","南昌县","新建县","安义县","进贤县","红谷滩新区","高新区"]);
    dsy.add("0_14_1", ["浔阳区","庐山区","瑞昌市","九江县","武宁县","修水县","永修县","德安县","星子县","都昌县","湖口县","彭泽县","共青城市","经济技术开发区","八里湖新区","庐山风景名胜区"]);
    dsy.add("0_14_2", ["珠山区","昌江区","乐平市","浮梁县"]);
    dsy.add("0_14_3",["月湖区","贵溪市","余江县"]);
    dsy.add("0_14_4",["渝水区","分宜县"]);
    dsy.add("0_14_5",["安源区","湘东区","莲花县","上栗县","芦溪县"]);
    dsy.add("0_14_6",["章贡区","瑞金市","南康市","赣县","信丰县","大余县","上犹县","崇义县","安远县","龙南县","定南县","全南县","宁都县","于都县","兴国县","会昌县","寻乌县","石城县"]);
    dsy.add("0_14_7",["信州区","德兴市","上饶县","广丰县","玉山县","铅山县","横峰县","弋阳县","余干县","鄱阳县","万年县","婺源县"]);
    dsy.add("0_14_8",["临川区","南城县","黎川县","南丰县","崇仁县","乐安县","宜黄县","金溪县","资溪县","东乡县","广昌县"]);
    dsy.add("0_14_9",["袁州区","丰城市","樟树市","高安市","奉新县","万载县","上高县","宜丰县","靖安县","铜鼓县"]);
    dsy.add("0_14_10",["吉州区","青原区","井冈山市","吉安县","吉水县","峡江县","新干县","永丰县","泰和县","遂川县","万安县","安福县","永新县"]);
    dsy.add("0_14",["南昌市","九江市","景德镇市","鹰潭市","新余市","萍乡市","赣州市","上饶市","抚州市","宜春市","吉安市"]);
    dsy.add("0_15_0",["市中区","历下区","槐荫区","高新区","天桥区","历城区","长清区","章丘市","平阴县","济阳县","商河县"]);
    dsy.add("0_15_1",["市南区","市北区","四方区","黄岛区","崂山区","城阳区","李沧区","胶州市","即墨市","平度市","莱西市","高新区"]);
    dsy.add("0_15_2",["东昌府区","临清市","阳谷县","莘县","茌平县","东阿县","冠县","高唐县"]);
    dsy.add("0_15_3",["德城区","乐陵市","禹城市","陵县","平原县","夏津县","武城县","齐河县","临邑县","宁津县" ,"庆云县"]);
    dsy.add("0_15_4",["东营区","河口区","垦利县","利津县","广饶县"]);
    dsy.add("0_15_5",["张店区","淄川区","博山区","临淄区","周村区","桓台县","高青县","沂源县"]);
    dsy.add("0_15_6",["潍城区","寒亭区","坊子区","高新区","奎文区","安丘市","昌邑市","高密市","青州市","诸城市","寿光市","临朐县","昌乐县"]);
    dsy.add("0_15_7",["莱山区","芝罘区","福山区","开发区","牟平区","栖霞市","海阳市","龙口市","莱阳市","莱州市","蓬莱市","招远市","长岛县"]);
    dsy.add("0_15_8",["环翠区","工业新区","荣成市","乳山市","文登市"]);
    dsy.add("0_15_9",["东港区","岚山区","新市区","五莲县","莒县"]);
    dsy.add("0_15_10",["兰山区","罗庄区","河东区","郯城县","苍山县","莒南县","沂水县","蒙阴县","平邑县","费县","沂南县","临沭县"]);
    dsy.add("0_15_11",["薛城区","市中区","峄城区","台儿庄区","山亭区","滕州市"]);
    dsy.add("0_15_12",["市中区","高新区","任城区","曲阜市","兖州市","邹城市","微山县","鱼台县","金乡县","嘉祥县","汶上县","泗水县","梁山县"]);
    dsy.add("0_15_13",["泰山区","岱岳区","新泰市","肥城市","宁阳县","东平县"]);
    dsy.add("0_15_14",["莱城区","钢城区"]);
    dsy.add("0_15_15",["滨城区","北海新区","惠民县","阳信县","无棣县","沾化县","博兴县","邹平县"]);
    dsy.add("0_15_16",["牡丹区","曹县","定陶县","成武县","单县","巨野县","郓城县","鄄城县","东明县"]);
    dsy.add("0_15",["济南市","青岛市","聊城市","德州市","东营市","淄博市","潍坊市","烟台市","威海市","日照市","临沂市","枣庄市","济宁市","泰安市","莱芜市","滨州市","菏泽市"]);
    dsy.add("0_16_0",["中原区","二七区","郑东新区","管城区","金水区","经济开发区","高新技术开发区","上街区","惠济区","新郑市","登封市","新密市","巩义市","荥阳市","中牟县"]);
    dsy.add("0_16_1",["鼓楼区","龙亭区","顺河区","禹王台区","金明区","杞县","通许县","尉氏县","开封县","兰考县"]);
    dsy.add("0_16_2",["湖滨区","义马市","灵宝市","渑池县","陕县","卢氏县"]);
    dsy.add("0_16_3",["西工区","老城区","瀍河区","涧西区","吉利区","洛龙区","偃师市","孟津县","新安县","栾川县","嵩县","汝阳县","宜阳县","洛宁县","伊川县","伊滨区"]);
    dsy.add("0_16_4", ["解放区","山阳区","中站区","马村区","孟州市","沁阳市","修武县","博爱县","武陟县","温县"]);
    dsy.add("0_16_5",["卫滨区","红旗区","凤泉区","牧野区","卫辉市","辉县市","新乡县","获嘉县","原阳县","延津县","封丘县","长垣县"]);
    dsy.add("0_16_6",["淇滨区","山城区","鹤山区","浚县","淇县"]);
    dsy.add("0_16_7",["北关区","文峰区","殷都区","龙安区","林州市","安阳县","开发区","汤阴县","滑县","内黄县"]);
    dsy.add("0_16_8",["华龙区","清丰县","南乐县","范县","台前县","濮阳县"]);
    dsy.add("0_16_9",["梁园区","睢阳区","永城市","虞城县","民权县","宁陵县","睢县","夏邑县","柘城县"]);
    dsy.add("0_16_10",["魏都区","禹州市","长葛市","许昌县","鄢陵县","襄城县"]);
    dsy.add("0_16_11",["源汇区","郾城区","召陵区","舞阳县","临颍县"]);
    dsy.add("0_16_12",["新华区","卫东区","湛河区","石龙区","舞钢市","汝州市","宝丰县","叶县","鲁山县","郏县"]);
    dsy.add("0_16_13",["卧龙区","宛城区","邓州市","南召县","方城县","西峡县","镇平县","内乡县","淅川县","社旗县","唐河县","新野县","桐柏县"]);
    dsy.add("0_16_14",["狮河区","平桥区","息县","淮滨县","潢川县","光山县","固始县","商城县","罗山县","新县"]);
    dsy.add("0_16_15",["川汇区","项城市","扶沟县","西华县","商水县","太康县","鹿邑县","郸城县","淮阳县","沈丘县","东新区","经济开发区"]);
    dsy.add("0_16_16",["驿城区","确山县","泌阳县","遂平县","西平县","上蔡县","汝南县","平舆县","新蔡县","正阳县",]);
    dsy.add("0_16_17",["玉泉街道","北海街道","天坛街道","沁园街道","济水街道","五龙口镇","下冶镇","轵城镇","王屋镇","思礼镇","邵原镇","坡头镇","梨林镇","克井镇","大峪镇","承留镇"]);
    dsy.add("0_16",["郑州市","开封市","三门峡市","洛阳市","焦作市","新乡市","鹤壁市","安阳市","濮阳市","商丘市","许昌市","漯河市","平顶山市","南阳市","信阳市","周口市","驻马店市","济源市"]);
    dsy.add("0_17_0",["江岸区","江汉区","硚口区","汉阳区","武昌区","武昌经济技术开发区","青山区","洪山区","东西湖区","汉南区","蔡甸区","江夏区","黄陂区","新洲区"]);
    dsy.add("0_17_1",["张湾区","茅箭区","丹江口市","郧县","竹山县","房县","郧西县","竹溪县"]);
    dsy.add("0_17_2",["襄城区","樊城区","襄州区","老河口市","枣阳市","宜城市","南漳县","谷城县","保康县"]);
    dsy.add("0_17_3",["东宝区","掇刀区","钟祥市","沙洋县","京山县"]);
    dsy.add("0_17_4",["孝南区","应城市","安陆市","汉川市","孝昌县","大悟县","云梦县"]);
    dsy.add("0_17_5",["黄州区","麻城市","武穴市","红安县","罗田县" ,"英山县","浠水县","蕲春县","黄梅县","团风县"]);
    dsy.add("0_17_6",["鄂城区","梁子湖区","华容区"]);
    dsy.add("0_17_7",["黄石港区","西塞山区","下陆区","铁山区","大冶市","阳新县","经济技术开发区"]);
    dsy.add("0_17_8",["咸安区","赤壁市","嘉鱼县","通城县","崇阳县","通山县"]);
    dsy.add("0_17_9",["沙市区","荆州区","石首市","洪湖市","松滋市","江陵县","公安县","监利县"]);
    dsy.add("0_17_10",["西陵区","伍家岗区","点军区","猇亭区","夷陵区","枝江市","宜都市","当阳市","远安县","兴山县","秭归县","长阳县","五峰县"]);
    dsy.add("0_17_11",["曾都区","广水市","随县"]);
    dsy.add("0_17_12",["恩施市","利川市","建始县","巴东县","宣恩县","咸丰县","来凤县","鹤峰县"]);
    dsy.add("0_17_13",["龙华山街道","沙嘴街道","干河街道","郑场街道","毛嘴镇","豆河镇","三伏潭镇","胡场镇","长埫口镇","西流河镇","沙湖镇","杨林尾镇","彭场镇","张沟镇","郭河镇","沔城镇","通海口镇","陈场镇","工业园区","九合垸原种场","沙湖原种场","排湖鱼场","五湖渔场","赵西垸林场","刘家垸林场","畜禽良种场"]);
    dsy.add("0_17_14",["侨乡街道开发区","竟陵街道","杨林街道","佛子山镇","多宝镇","拖市镇","张港镇","蒋场镇","汪场镇","渔薪镇","黄潭镇","岳口镇","横林镇","彭市镇","麻阳镇","多祥镇","干驿镇","马湾镇","卢市镇","小板镇","九真镇","皂市镇","胡市镇","石河镇","净潭乡","蒋湖农场","白茅湖农场","沉湖管委会"]);
    dsy.add("0_17_15",["园林","杨市","周矶","广华","泰丰","竹根滩镇","高石碑镇","积玉口镇","渔阳镇","王场镇","熊口镇","老新镇","浩口镇","张金镇","龙湾镇","江汉石油管理局","潜江经济开发区","西大垸管理区","运粮湖管理区","周矶管理区","后湖管理区","熊口管理区","总口管理区","高场原种场","浩口原种场"]);
    dsy.add("0_17_16",["松柏镇","阳日镇","木鱼镇","红坪镇","新华镇","宋洛乡","九湖乡","下谷坪乡"])
    dsy.add("0_17",["武汉市","十堰市","襄阳市","荆门市","孝感市","黄冈市","鄂州市","黄石市","咸宁市","荆州市","宜昌市","随州市","恩施州","仙桃市","天门市","潜江市","神农架林区"]);
    dsy.add("0_18_0",["岳麓区","芙蓉区","天心区","开福区","雨花区","浏阳市","长沙县","望城县","宁乡县"]);
    dsy.add("0_18_1",["永定区","武陵源区","慈利县","桑植县"]);
    dsy.add("0_18_2",["武陵区","鼎城区","津市市","安乡县","汉寿县","澧县","临澧县","桃源县","石门县"]);
    dsy.add("0_18_3",["赫山区","资阳区","沅江市","南县","桃江县","安化县"]);
    dsy.add("0_18_4",["岳阳楼区","君山区","云溪区","汨罗市","临湘市","岳阳县","华容县","湘阴县","平江县"]);
    dsy.add("0_18_5",["天元区","荷塘区","芦淞区","石峰区","醴陵市","株洲县","攸县","茶陵县","炎陵县"]);
    dsy.add("0_18_6",["岳塘区","雨湖区","湘乡市","韶山市","湘潭县"]);
    dsy.add("0_18_7",["雁峰区","珠晖区","石鼓区","蒸湘区","南岳区","常宁市","耒阳市","衡阳县","衡南县","衡山县","衡东县","祁东县"]);
    dsy.add("0_18_8",["北湖区","苏仙区","资兴市","桂阳县","永兴县","宜章县","嘉禾县","临武县","汝城县","桂东县","安仁县"]);
    dsy.add("0_18_9",["冷水滩区","零陵区","东安县","道县","宁远县","江永县","蓝山县","新田县","双牌县","祁阳县","江华县",]);
    dsy.add("0_18_10",["双清区","大祥区","北塔区","武冈市","邵东县","邵阳县","新邵县","隆回县","洞口县","绥宁县","新宁县" ,"城步县"]);
    dsy.add("0_18_11",["鹤城区","洪江市","沅陵县","辰溪县","溆浦县","中方县","会同县","麻阳县","新晃县","芷江县","靖州县","通道县"]);
    dsy.add("0_18_12",["娄星区","冷水江市","涟源市","双峰县","新化县"]);
    dsy.add("0_18_13",["吉首市","泸溪县","凤凰县","花垣县","保靖县","古丈县","永顺县","龙山县"]);
    dsy.add("0_18_14",["韶山市区内"]);
    dsy.add("0_18",["长沙市","张家界市","常德市","益阳市","岳阳市","株洲市","湘潭市","衡阳市","郴州市","永州市","邵阳市","怀化市","娄底市","湘西州","韶山市"]);
    dsy.add("0_19_0",["越秀区","荔湾区","海珠区","天河区","白云区","黄埔区","番禺区","花都区","南沙区","萝岗区","增城市","从化市"]);
    dsy.add("0_19_1",["福田区","罗湖区","南山区","宝安区","龙岗区","盐田区","光明新区","坪山新区","龙华新区","大鹏新区"]);
    dsy.add("0_19_2",["清城区","英德市","连州市","佛冈县","阳山县","清新县","连山县","连南县"]);
    dsy.add("0_19_3",["浈江区","武江区","曲江区","乐昌市","南雄市","始兴县","仁化县","翁源县","新丰县","乳源县"]);
    dsy.add("0_19_4",["源城区","紫金县","龙川县","连平县","和平县","东源县"]);
    dsy.add("0_19_5",["梅江区","兴宁市","梅县","大埔县","丰顺县","五华县","平远县","蕉岭县"]);
    dsy.add("0_19_6",["湘桥区","潮安县","饶平县","枫溪区"]);
    dsy.add("0_19_7",["金平区","濠江区","龙湖区","潮阳区","潮南区","澄海区","南澳县"]);
    dsy.add("0_19_8",["榕城区","普宁市","揭东县","揭西县","惠来县"]);
    dsy.add("0_19_9",["城区","陆丰市","海丰县","陆河县"]);
    dsy.add("0_19_10",["惠城区","惠阳区","大亚湾区","博罗县","惠东县","龙门县"]);
    dsy.add("0_19_11",["长安镇","莞城区","南城区","寮步镇","大岭山镇","横沥镇","常平镇","厚街镇","万江区","樟木头镇","塘厦镇","凤岗镇","大朗镇","东坑镇","清溪镇","企石镇","茶山镇","东城区","虎门镇","黄江镇","石排镇","道滘镇","沙田镇","高埗镇","石龙镇","石碣镇","洪梅镇","麻涌镇","松山镇","桥头镇","望牛墩镇","中堂镇","谢岗镇"]);
    dsy.add("0_19_12",["香洲区","斗门区","金湾区"]);
    dsy.add("0_19_13",["东区街道","西区街道","南区街道","石岐区街道","火炬开发区","小榄镇","古镇","三乡镇","民众镇","东凤镇","板芙镇","神湾镇","横栏镇","港口镇","三角镇","大涌镇","南头镇","沙溪镇","坦洲镇","黄圃镇","五桂山镇","南朗镇","沙朗镇","阜沙镇","东升镇"]);
    dsy.add("0_19_14",["台山区","新会区","鹤山市","江海区","蓬江区","开平市","恩平市"]);
    dsy.add("0_19_15",["禅城区","南海区","顺德区","三水区","高明区"]);
    dsy.add("0_19_16",["端州区","鼎湖区","高要市","四会市","广宁县","怀集县","封开县","德庆县"]);
    dsy.add("0_19_17",["云城区","罗定市","云安县","新兴县","郁南县"]);
    dsy.add("0_19_18",["江城区","阳春市","阳西县","阳东县"]);
    dsy.add("0_19_19",["茂南区","茂港区","化州市","信宜市","高州市","电白县"]);
    dsy.add("0_19_20",["赤坎区","霞山区","坡头区","麻章区","吴川市","廉江市","雷州市","遂溪县","徐闻县"]);
    dsy.add("0_19",["广州市","深圳市","清远市","韶关市","河源市","梅州市","潮州市","汕头市","揭阳市","汕尾市","惠州市","东莞市","珠海市","中山市","江门市","佛山市","肇庆市","云浮市","阳江市","茂名市","湛江市"]);
    dsy.add("0_20_0",["青秀区","兴宁区","江南区","西乡塘区","良庆区","邕宁区","武鸣县","横县","宾阳县","上林县","隆安县","马山县"]);
    dsy.add("0_20_1",["象山区","叠彩区","秀峰区","七星区","雁山区","阳朔县","临桂县","灵川县","全州县","兴安县","永福县","灌阳县","资源县","平乐县","龙胜县","恭城县","荔浦县"]);
    dsy.add("0_20_2",["城中区","鱼峰区","柳南区","柳北区","柳江县","柳城县","鹿寨县","融安县","三江县","融水县"]);
    dsy.add("0_20_3",["万秀区","蝶山区","长洲区","岑溪市","苍梧县","藤县","蒙山县"]);
    dsy.add("0_20_4",["港北区","港南区","覃塘区","桂平市","平南县"]);
    dsy.add("0_20_5",["玉州区","北流市","兴业县","容县","陆川县","博白县"]);
    dsy.add("0_20_6",["钦南区","钦北区","灵山县","浦北县"]);
    dsy.add("0_20_7",["海城区","银海区","铁山港区","合浦县"]);
    dsy.add("0_20_8",["港口区","防城区","东兴市","上思县"]);
    dsy.add("0_20_9",["江州区","凭祥市","扶绥县","大新县","天等县","宁明县","龙州县"]);
    dsy.add("0_20_10",["右江区","田阳县","田东县","平果县","德保县","靖西县","那坡县","凌云县","乐业县","西林县","田林县","隆林县"]);
    dsy.add("0_20_11",["金城江区","宜州市","南丹县","天峨县","凤山县","东兰县","巴马县","都安县","大化县","罗城县","环江县"]);
    dsy.add("0_20_12",["兴宾区","合山市","象州县","武宣县","忻城县","金秀县"]);
    dsy.add("0_20_13",["八步区","昭平县","钟山县","富川县","平桂管理区"]);
    dsy.add("0_20",["南宁市","桂林市","柳州市","梧州市","贵港市","玉林市","钦州市","北海市","防城港市","崇左市","百色市","河池市","来宾市","贺州市"]);
    dsy.add("0_21_0",["龙华区","秀英区","琼山区","美兰区"]);
    dsy.add("0_21_1",["崖城镇","海棠湾镇","吉阳镇","凤凰镇","天涯镇","育才镇","河西区","河东区","南田农场","南新农场","南岛农场","立才农场","南滨农场"]);
    dsy.add("0_21_2",["文城镇","重兴镇","蓬莱镇","会文镇","东路镇","潭牛镇","东阁镇","文教镇","东郊镇","龙楼镇","昌洒镇","翁田镇","抱罗镇","冯坡镇","锦山镇","铺前镇","公坡镇","迈号镇","清谰镇","南阳镇","新桥镇","头苑镇","宝芳乡","龙马乡","湖山乡","东路农场","南阳农场","罗豆农场","橡胶研究所"]);
    dsy.add("0_21_3",["嘉积镇","万泉镇","石壁镇","中原镇","博鳌镇","阳江镇","龙江镇","潭门镇","塔洋镇","长坡镇","大路镇","会山镇","彬村山华侨农场","东太农场","东红农场","东升农场","南俸农场"]);
    dsy.add("0_21_4",["万城镇","龙滚镇","和乐镇","后安镇","大茂镇","东澳镇","礼纪镇","长丰镇","山根镇","北大镇","南桥镇","三更罗镇","六连林场","东兴农场","东和农场","新中农场","兴隆华侨农场"]);
    dsy.add("0_21_5",["通什镇","南圣镇","毛阳镇","番阳镇","畅好乡","毛道乡","水满乡","畅好农场"]);
    dsy.add("0_21_6",["八所镇","东河镇","大田镇","感城镇","板桥镇","三家镇","四更镇","新龙镇","天安乡","江边乡","广坝农场","东方华侨农场"]);
    dsy.add("0_21_7",["热作学院","那大镇","富克镇","和庆镇","南丰镇","大成镇","雅星镇","兰洋镇","光村镇","木棠镇","海头镇","峨蔓镇","三都镇","王五镇","白马井镇","中和镇","排浦镇","东城镇","新州镇","洋浦经济开发区","西培农场","西联农场","蓝洋农场","八一农场","西华农场","西庆农场","西流农场","新盈农场","白龙山农场","红岭农场"]);
    dsy.add("0_21_8",["中沙群岛","西沙群岛","南沙群岛"]);
    dsy.add("0_21_9",["城区","临城镇","波莲镇","东英镇","博厚镇","皇桐镇","多文镇","和舍镇","南宝镇","新盈镇","调楼镇","加来镇","红华农场","加来农场"]);
    dsy.add("0_21_10",["金江镇","老城镇","瑞溪镇","永发镇","加乐镇","文儒镇","中兴镇","仁兴镇","福山镇","桥头镇","大丰镇","红光农场","西达农场","金安农场"]);
    dsy.add("0_21_11",["黄竹镇","城区","定城镇","新竹镇","龙湖镇","雷鸣镇","龙门镇","龙河镇","岭口镇","翰林镇","富文镇","金鸡岭农场","中瑞农场","南海农场"]);
    dsy.add("0_21_12",["县城内","屯城镇","新兴镇","枫木镇","乌坡镇","南吕镇","南坤镇","中建农场","坡心镇","中坤农场","西昌镇"]);
    dsy.add("0_21_13",["红林农场","城区","石碌镇","叉河镇","十月田镇","乌烈镇","昌化镇","海尾镇","七叉镇","王下乡","海南矿业公司","霸王岭林场"]);
    dsy.add("0_21_14",["南开乡","阜龙乡","青松乡","金波乡","荣邦乡","城区","白沙农场","牙叉镇","龙江农场","七坊镇","邦溪农场","邦溪镇","打安镇","细水乡","元门乡"]);
    dsy.add("0_21_15",["吊罗山乡","黎母山林业公司","阳江农场","乌石农场","加钗农场","长征农场","营根镇","湾岭镇","黎母山镇","和平镇","红毛镇","中平镇","上安乡","什运乡","城区"]);
    dsy.add("0_21_16",["吊罗山林业公司","岭门农场","南平农场","椰林镇","光坡镇","三才镇","英州镇","隆广镇","文罗镇","本号镇","新村镇","黎安镇","提蒙乡","群英乡","城区"]);
    dsy.add("0_21_17",["保亭研究所","新星农场","金江农场","三道农场","保城镇","什玲镇","加茂镇","响水镇","新政镇","三道镇","六弓乡","南林乡","毛感乡"]);
    dsy.add("0_21_18",["尖峰岭林业公司","莺歌海盐场","山荣农场","乐光农场","抱由镇","保国农场","万冲镇","大安镇","志仲镇","千家镇","九所镇","利国镇","黄流镇","佛罗","尖峰镇","莺歌海镇","城区"]);
    dsy.add("0_21",["海口市","三亚市","文昌市","琼海市","万宁市","五指山市","东方市","儋州市","三沙市","临高县","澄迈县","定安县","屯昌县","昌江县","白沙县","琼中县","陵水县","保亭县","乐东县"]);
    dsy.add("0_22_0",["青羊区","锦江区","金牛区","武侯区","成华区","高新区","高新西区","龙泉驿区","青白江区","新都区","温江区","都江堰市","彭州市","邛崃市","崇州市","金堂县","双流县","郫县","大邑县","蒲江县","新津县"]);
    dsy.add("0_22_1",["利州区","元坝区","朝天区","旺苍县","青川县","剑阁县","苍溪县"]);
    dsy.add("0_22_2",["涪城区","游仙区","高新区","经开区","江油市","三台县","盐亭县","安县","梓潼县","北川县","平武县"]);
    dsy.add("0_22_3",["旌阳区","什邡市","广汉市","绵竹市","罗江县","中江县"]);
    dsy.add("0_22_4",["顺庆区","高坪区","嘉陵区","阆中市","南部县","营山县","蓬安县","仪陇县","西充县"]);
    dsy.add("0_22_5",["广安区","华蓥市","岳池县","武胜县","邻水县"]);
    dsy.add("0_22_6",["船山区","安居区","蓬溪县","射洪县","大英县"]);
    dsy.add("0_22_7",["市中区","东兴区","威远县","资中县","隆昌县"]);
    dsy.add("0_22_8",["市中区","沙湾区","五通桥区","金口河区","峨眉山市","犍为县","井研县","夹江县","沐川县","峨边县","马边县"]);
    dsy.add("0_22_9",["自流井区","大安区","贡井区","沿滩区","荣县","富顺县"]);
    dsy.add("0_22_10",["江阳区","纳溪区","龙马潭区","泸县","合江县","叙永县","古蔺县"]);
    dsy.add("0_22_11",["翠屏区","宜宾县","南溪县","江安县","长宁县","高县","筠连县","珙县","兴文县","屏山县"]);
    dsy.add("0_22_12",["东区","西区","仁和区","米易县","盐边县"]);
    dsy.add("0_22_13",["巴州区","通江县","南江县","平昌县"]);
    dsy.add("0_22_14",["通川区","万源市","达县","宣汉县","开江县","大竹县","渠县"]);
    dsy.add("0_22_15",["雁江区","简阳市","乐至县","安岳县"]);
    dsy.add("0_22_16",["东坡区","仁寿县","彭山县","洪雅县","丹棱县","青神县"]);
    dsy.add("0_22_17",["雨城区","名山县","荥经县","汉源县","石棉县","天全县","芦山县","宝兴县"]);
    dsy.add("0_22_18",["马尔康县","汶川县","理县","茂县","松潘县","九寨沟县","金川县","小金县","黑水县","壤塘县","阿坝县","若尔盖县","红原县"]);
    dsy.add("0_22_19",["康定县","泸定县","丹巴县","九龙县","雅江县","道孚县","炉霍县","甘孜县","新龙县","德格县","白玉县","石渠县","色达县","理塘县","巴塘县","乡城县","稻城县","得荣县"]);
    dsy.add("0_22_20",["西昌市","盐源县","德昌县","会理县","会东县","宁南县","普格县","布拖县","金阳县","昭觉县","喜德县","冕宁县","越西县","甘洛县","美姑县","雷波县","木里县"]);
    dsy.add("0_22",["成都市","广元市","绵阳市","德阳市","南充市","广安市","遂宁市","内江市","乐山市","自贡市","泸州市","宜宾市","攀枝花市","巴中市","达州市","资阳市","眉山市","雅安市","阿坝州","甘孜州","凉山州"]);

    dsy.add("0_23_0",["盘龙区","五华区","官渡区","西山区","东川区","安宁市","呈贡县","晋宁县","富民县","宜良县","嵩明县","石林县","禄劝县","寻甸县"]);
    dsy.add("0_23_1",["麒麟区","宣威市","马龙县","沾益县","富源县","罗平县","师宗县","陆良县","会泽县"]);
    dsy.add("0_23_2",["红塔区","江川县","澄江县","通海县","华宁县","易门县","峨山县","新平县","元江县"]);
    dsy.add("0_23_3",["隆阳区","施甸县","腾冲县","龙陵县","昌宁县"]);
    dsy.add("0_23_4",["昭阳区","鲁甸县","巧家县","盐津县","大关县","永善县","绥江县","镇雄县","彝良县","威信县","水富县"]);
    dsy.add("0_23_5",["古城区","永胜县","华坪县","玉龙县","宁蒗县"]);
    dsy.add("0_23_6",["临翔区","凤庆县","云县","永德县","镇康县","双江县","耿马县","沧源县"]);
    dsy.add("0_23_7",["芒市","瑞丽市","梁河县","盈江县","陇川县"]);
    dsy.add("0_23_8",["泸水县","福贡县","贡山县","兰坪县"]);
    dsy.add("0_23_9",["香格里拉县","德钦县","维西县"]);
    dsy.add("0_23_10",["大理市","祥云县","宾川县","弥渡县","永平县","云龙县","洱源县","剑川县","鹤庆县","漾濞县","南涧县","巍山县"]);
    dsy.add("0_23_11",["楚雄市","双柏县","牟定县","南华县","姚安县","大姚县","永仁县","元谋县","武定县","禄丰县"]);
    dsy.add("0_23_12",["蒙自县","个旧市","开远市","绿春县","建水县","石屏县","弥勒县","泸西县","元阳县","红河县","金平县","河口县","屏边县"]);
    dsy.add("0_23_13",["文山市","砚山县","西畴县","麻栗坡县","马关县","丘北县","广南县","富宁县"]);
    dsy.add("0_23_14",["景洪市","勐海县","勐腊县"]);
    dsy.add("0_23_15",["孟连县","思茅区","宁洱县","景东县","镇沅县","景谷县","墨江县","澜沧县","西盟县","江城县"]);
    dsy.add("0_23",["昆明市","曲靖市","玉溪市","保山市","昭通市","丽江市","临沧市","德宏州","怒江州","迪庆州","大理州","楚雄州","红河州","文山州","西双版纳州","普洱市"]);

    dsy.add("0_24_0",["莲湖区","新城区","碑林区","灞桥区","未央区","雁塔区","阎良区","临潼区","长安区","蓝田县","周至县","户县","高陵县","杨凌农业示范区"]);
    dsy.add("0_24_1",["宝塔区","延长县","延川县","子长县","安塞县","志丹县","吴起县","甘泉县","富县","洛川县","宜川县","黄龙县","黄陵县"]);
    dsy.add("0_24_2",["耀州区","王益区","印台区","宜君县"]);
    dsy.add("0_24_3",["临渭区","华阴市","韩城市","华县","潼关县","大荔县","蒲城县","澄城县","白水县","合阳县","富平县"]);
    dsy.add("0_24_4",["秦都区","杨陵区","渭城区","兴平市","三原县","泾阳县","乾县","礼泉县","永寿县","彬县","长武县","旬邑县","淳化县","武功县"]);
    dsy.add("0_24_5",["渭滨区","金台区","陈仓区","凤翔县","岐山县","扶风县","眉县","陇县","千阳县","麟游县","凤县","太白县"]);
    dsy.add("0_24_6",["汉台区","南郑县","城固县","洋县","西乡县","勉县","宁强县","略阳县","镇巴县","留坝县","佛坪县"]);
    dsy.add("0_24_7",["榆阳区","神木县","府谷县","横山县","靖边县","定边县","绥德县","米脂县","佳县","吴堡县","清涧县","子洲县"]);
    dsy.add("0_24_8",["汉滨区","汉阴县","石泉县","宁陕县","紫阳县","岚皋县","平利县","镇坪县","旬阳县","白河县"]);
    dsy.add("0_24_9",["商州区","洛南县","丹凤县","商南县","山阳县","镇安县","柞水县"]);
    dsy.add("0_24",["西安市","延安市","铜川市","渭南市","咸阳市","宝鸡市","汉中市","榆林市","安康市","商洛市"]);
    dsy.add("0_25_0",["城关区","七里河区","西固区","安宁区","红古区","永登县","皋兰县","榆中县"]);
    dsy.add("0_25_1",["长城区","镜铁区","雄关区"]);
    dsy.add("0_25_2",["白银区","平川区","靖远县","会宁县","景泰县"]);
    dsy.add("0_25_3",["秦州区","麦积区","清水县","秦安县","甘谷县","武山县","张家川县"]);
    dsy.add("0_25_4",["凉州区","民勤县","古浪县","天祝县"]);
    dsy.add("0_25_5",["肃州区","玉门市","敦煌市","金塔县","瓜州县","肃北县","阿克塞县"]);
    dsy.add("0_25_6",["甘州区","民乐县","临泽县","高台县","山丹县","肃南县"]);
    dsy.add("0_25_7",["西峰区","庆城县","环县","华池县","合水县","正宁县","宁县","镇原县"]);
    dsy.add("0_25_8",["崆峒区","泾川县","灵台县","崇信县","华亭县","庄浪县","静宁县","镇原县"]);
    dsy.add("0_25_9",["安定区","通渭县","临洮县","漳县","岷县","渭源县","陇西县"]);
    dsy.add("0_25_10",["武都区","成县","宕昌县","康县","文县","西和县","礼县","两当县","徽县"]);
    dsy.add("0_25_11",["临夏市","临夏县","康乐县","永靖县","广河县","和政县","东乡族自治县","积石山县"]);
    dsy.add("0_25_12",["合作市","临潭县","卓尼县","舟曲县","迭部县","玛曲县","碌曲县","夏河县"]);
    dsy.add("0_25_13",["永昌县","金川区"]);
    dsy.add("0_25",["兰州市","嘉峪关市","白银市","天水市","武威市","酒泉市","张掖市","庆阳市","平凉市","定西市","陇南市","临夏州","甘南州","金昌市"]);

    dsy.add("0_26_0",["兴庆区","金凤区","西夏区","灵武市","永宁县","贺兰县"]);
    dsy.add("0_26_1",["大武口区","惠农区","平罗县"]);
    dsy.add("0_26_2",["利通区","青铜峡市","盐池县","同心县","红寺堡开发区"]);
    dsy.add("0_26_3",["原州区","西吉县","隆德县","泾源县","彭阳县"]);
    dsy.add("0_26_4",["沙坡头区","中宁县","海原县"]);
    dsy.add("0_26",["银川市","石嘴山市","吴忠市","固原市","中卫市"]);

})();
